In [1]:
import pandas as pd

In [2]:
from numpy import nan as NA

In [3]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [4]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
import numpy as np

In [6]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.820685       NaN       NaN
1 -0.002527       NaN       NaN
2 -0.203810       NaN  0.662587
3 -0.270489       NaN  0.084873
4  0.471039  0.337472 -0.577224
5 -0.917744 -0.377065 -1.256719
6 -1.002791 -0.913723 -0.308764

In [7]:
df.dropna()

          0         1         2
4  0.471039  0.337472 -0.577224
5 -0.917744 -0.377065 -1.256719
6 -1.002791 -0.913723 -0.308764

In [8]:
df.dropna(thresh=2)

          0         1         2
2 -0.203810       NaN  0.662587
3 -0.270489       NaN  0.084873
4  0.471039  0.337472 -0.577224
5 -0.917744 -0.377065 -1.256719
6 -1.002791 -0.913723 -0.308764

In [9]:
df.fillna(0)

          0         1         2
0  1.820685  0.000000  0.000000
1 -0.002527  0.000000  0.000000
2 -0.203810  0.000000  0.662587
3 -0.270489  0.000000  0.084873
4  0.471039  0.337472 -0.577224
5 -0.917744 -0.377065 -1.256719
6 -1.002791 -0.913723 -0.308764

In [10]:
df.fillna({1: 0.11, 2: 0.22})

          0         1         2
0  1.820685  0.110000  0.220000
1 -0.002527  0.110000  0.220000
2 -0.203810  0.110000  0.662587
3 -0.270489  0.110000  0.084873
4  0.471039  0.337472 -0.577224
5 -0.917744 -0.377065 -1.256719
6 -1.002791 -0.913723 -0.308764

In [11]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 1, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   1
3  two   3
4  one   3
5  two   4
6  two   4

In [12]:
data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [13]:
data.drop_duplicates()    # remove duplicate rows, by default keep first seen

    k1  k2
0  one   1
1  two   1
3  two   3
4  one   3
5  two   4

In [14]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [15]:
data.drop_duplicates(keep='last')

    k1  k2
1  two   1
2  one   1
3  two   3
4  one   3
6  two   4

In [16]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'BACON',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        BACON    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [17]:
meat_to_animal = {'bacon': 'pig',
                 'pulled pork': 'pig',
                 'pastrami': 'cow',
                 'corned beef': 'cow',
                 'honey ham': 'pig',
                 'nova lox': 'salmon'}

In [18]:
meat = data['food'].str.lower()
meat

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [19]:
data['animal'] = pd.Series.map(meat, meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        BACON    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [20]:
# .map(self, arg) works on pandas series only and is element-wise operation

In [21]:
data['animal_alt'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal animal_alt
0        bacon     4.0     pig        pig
1  pulled pork     3.0     pig        pig
2        BACON    12.0     pig        pig
3     Pastrami     6.0     cow        cow
4  corned beef     7.5     cow        cow
5        Bacon     8.0     pig        pig
6     pastrami     3.0     cow        cow
7    honey ham     5.0     pig        pig
8     nova lox     6.0  salmon     salmon

In [22]:
data = pd.Series([1., -999, 2., -999, -1000, 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [23]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [24]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [25]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [26]:
data = pd.DataFrame(np.arange(12).reshape(3, 4),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [27]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [28]:
cap_index = data.index.map(lambda x: x.upper())
cap_index

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [29]:
data.index = cap_index
data.index

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [30]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [31]:
data.rename(str.title, inplace=True)     # default renames indexes
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [32]:
data.rename(columns=str.upper, inplace=True)
data

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [33]:
data.rename(index={'ohio'.title(): '-'},
           columns={'three'.upper(): 'xxx'})

          ONE  TWO  xxx  FOUR
-           0    1    2     3
Colorado    4    5    6     7
New York    8    9   10    11

In [34]:
# .rename can modify individual index or column labels with dict

In [35]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [36]:
cats.dtype

CategoricalDtype(categories=[(18, 25], (25, 35], (35, 60], (60, 100]],
              ordered=True)

In [37]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [38]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [39]:
pd.value_counts(cats)      # this performs the bin counts

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [40]:
pd.cut(ages, bins=[18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [41]:
data = np.random.rand(20)
pd.cut(data, bins=4)

[(0.529, 0.729], (0.729, 0.929], (0.329, 0.529], (0.128, 0.329], (0.729, 0.929], ..., (0.329, 0.529], (0.128, 0.329], (0.329, 0.529], (0.128, 0.329], (0.128, 0.329]]
Length: 20
Categories (4, interval[float64]): [(0.128, 0.329] < (0.329, 0.529] < (0.529, 0.729] < (0.729, 0.929]]

In [42]:
data = np.arange(100)
pd.cut(data, 5, precision=0)

[(-0.1, 20.0], (-0.1, 20.0], (-0.1, 20.0], (-0.1, 20.0], (-0.1, 20.0], ..., (79.0, 99.0], (79.0, 99.0], (79.0, 99.0], (79.0, 99.0], (79.0, 99.0]]
Length: 100
Categories (5, interval[float64]): [(-0.1, 20.0] < (20.0, 40.0] < (40.0, 59.0] < (59.0, 79.0] < (79.0, 99.0]]

In [43]:
pd.value_counts(pd.cut(data, 5))

(79.2, 99.0]      20
(59.4, 79.2]      20
(39.6, 59.4]      20
(19.8, 39.6]      20
(-0.099, 19.8]    20
dtype: int64

In [44]:
data = np.random.rand(1000)    # uniform distribution [0, 1) - perform .cut vs .qcut binning

In [45]:
pd.value_counts(pd.cut(data, 4))      # cut is based on min and max values of data

(0.499, 0.748]       259
(-0.000906, 0.25]    253
(0.25, 0.499]        251
(0.748, 0.998]       237
dtype: int64

In [46]:
pd.value_counts(pd.qcut(data, 4))     # qcut cuts into quantile (4 equal % size) bins

(0.733, 0.998]                     250
(0.496, 0.733]                     250
(0.248, 0.496]                     250
(-0.0009086000000000001, 0.248]    250
dtype: int64

In [47]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [48]:
df.sample(3)

   0  1   2   3
2  8  9  10  11
1  4  5   6   7
0  0  1   2   3

In [49]:
df.sample(5)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [50]:
df.sample(10, replace=True)    # otherwiese sample size 10 is out of range

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [51]:
df = pd.DataFrame({'key': list('bbacab'), 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [52]:
pd.get_dummies(df)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [53]:
import re
text = 'foo   Bar\t  baz \tqux'

In [54]:
regex = re.compile(r'\s+')
regex.split(text)

['foo', 'Bar', 'baz', 'qux']

In [55]:
regex.sub('|', text)

'foo|Bar|baz|qux'

In [56]:
regex.search(text)

In [57]:
print(regex.match(text))

None

In [58]:
regex.findall(text)

['   ', '\t  ', ' \t']

In [59]:
regex = re.compile(r'([a-z]+)\s+', flags=re.IGNORECASE)
m = regex.match(text)

In [60]:
m.groups()

('foo',)

In [61]:
regex.findall(text)

['foo', 'Bar', 'baz']

In [62]:
regex.sub(r'Username: \1  ', text)

'Username: foo  Username: Bar  Username: baz  qux'

In [63]:
data = pd.Series(np.random.randn(9),
                 index=[list('aaabbccdd'), 
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]
                       ])
data

a  1    0.483737
   2    0.331692
   3   -0.665962
b  1    0.359154
   3    0.584458
c  1   -0.223611
   2   -0.414377
d  2    0.090612
   3    0.423125
dtype: float64

In [64]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [65]:
data['b']

1    0.359154
3    0.584458
dtype: float64

In [66]:
data['b', 3]

0.5844578313337461

In [67]:
data['b'][3]

0.5844578313337461

In [68]:
data.loc[:, 2]

a    0.331692
c   -0.414377
d    0.090612
dtype: float64

In [69]:
data.iloc[:4]

a  1    0.483737
   2    0.331692
   3   -0.665962
b  1    0.359154
dtype: float64

In [70]:
data.loc['a':'b']

a  1    0.483737
   2    0.331692
   3   -0.665962
b  1    0.359154
   3    0.584458
dtype: float64

In [71]:
data.unstack()

          1         2         3
a  0.483737  0.331692 -0.665962
b  0.359154       NaN  0.584458
c -0.223611 -0.414377       NaN
d       NaN  0.090612  0.423125

In [72]:
frame = pd.DataFrame(np.arange(12).reshape(4, 3),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=[['Ohio', 'Ohio', 'Colorado'], ['Gre', 'Red', 'Gre']])
frame

    Ohio     Colorado
     Gre Red      Gre
a 1    0   1        2
  2    3   4        5
b 1    6   7        8
  2    9  10       11

In [73]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'colour']
frame

state     Ohio     Colorado
colour     Gre Red      Gre
key1 key2
a    1       0   1        2
     2       3   4        5
b    1       6   7        8
     2       9  10       11

In [74]:
frame['Ohio']

colour     Gre  Red
key1 key2
a    1       0    1
     2       3    4
b    1       6    7
     2       9   10

In [75]:
frame.columns

MultiIndex([(    'Ohio', 'Gre'),
            (    'Ohio', 'Red'),
            ('Colorado', 'Gre')],
           names=['state', 'colour'])

In [76]:
new_col_labels = pd.MultiIndex.from_arrays([['London', 'Leeds', 'Leeds'], 
                                            ['South', 'Mid', 'North']],
                                           names=['city', 'region'])
frame.columns = new_col_labels
frame

city      London Leeds
region     South   Mid North
key1 key2
a    1         0     1     2
     2         3     4     5
b    1         6     7     8
     2         9    10    11

In [77]:
frame.swaplevel()

city      London Leeds
region     South   Mid North
key2 key1
1    a         0     1     2
2    a         3     4     5
1    b         6     7     8
2    b         9    10    11

In [78]:
frame.swaplevel(axis=1)

region     South   Mid North
city      London Leeds Leeds
key1 key2
a    1         0     1     2
     2         3     4     5
b    1         6     7     8
     2         9    10    11

In [79]:
frame.swaplevel().sort_index()

city      London Leeds
region     South   Mid North
key2 key1
1    a         0     1     2
     b         6     7     8
2    a         3     4     5
     b         9    10    11

In [80]:
frame.swaplevel().sort_index(level=1)

city      London Leeds
region     South   Mid North
key2 key1
1    a         0     1     2
2    a         3     4     5
1    b         6     7     8
2    b         9    10    11

In [81]:
frame

city      London Leeds
region     South   Mid North
key1 key2
a    1         0     1     2
     2         3     4     5
b    1         6     7     8
     2         9    10    11

In [82]:
frame.sum(level=1)

city   London Leeds
region  South   Mid North
key2
1           6     8    10
2          12    14    16

In [83]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one'] * 3 + ['two'] * 4,
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [84]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [85]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [86]:
df1 = pd.DataFrame({'key': list('bbacaab'), 'data1': range(7)})
df2 = pd.DataFrame({'key': list('abd'), 'data2': range(3)})     # many-to-one join

In [87]:
df1.merge(df2)    # merge by default is 'inner' join

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [88]:
df2.merge(df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [89]:
df1.merge(df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [90]:
df1 = pd.DataFrame({'key': list('bbacaab'), 'data1': range(7)})
df2 = pd.DataFrame({'key': list('ababbd'), 'data2': range(6)})    # many-to-many join

In [91]:
df1.merge(df2)

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      0      4
3    b      1      1
4    b      1      3
5    b      1      4
6    b      6      1
7    b      6      3
8    b      6      4
9    a      2      0
10   a      2      2
11   a      4      0
12   a      4      2
13   a      5      0
14   a      5      2

In [92]:
# merge,
# join - merging on index,
# concat,
# combine_first - patching missing data

In [93]:
df = pd.DataFrame({'key1': list('aabba'),
                  'key2': ['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.944335  0.369585
1    a  two -0.252704 -0.031236
2    b  one -1.170507  0.342664
3    b  two  1.154536 -0.511929
4    a  one -0.841211 -1.723035

In [94]:
grouped = df.groupby('key1')         # group items in whole of df by 'key1' label - no need to call df['key1']
grouped

In [95]:
grouped.mean()

         data1     data2
key1
a    -0.049860 -0.461562
b    -0.007986 -0.084632

In [96]:
df['data1'].groupby(df['key1']).mean()     # group items in series df['data1'] by another series df['key1'] in df

key1
a   -0.049860
b   -0.007986
Name: data1, dtype: float64

In [97]:
df.groupby('key1')['data1'].mean()         # alternatively.....use indexing with groupby on whole of df

key1
a   -0.049860
b   -0.007986
Name: data1, dtype: float64

In [98]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.051562
      two    -0.252704
b     one    -1.170507
      two     1.154536
Name: data1, dtype: float64

In [99]:
means.unstack()

key2       one       two
key1
a     0.051562 -0.252704
b    -1.170507  1.154536

In [100]:
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby(years).mean()       # can groupby any array even not belong to the dataframe

2005    0.615389
2006   -1.005859
Name: data1, dtype: float64

In [101]:
df.groupby('key1')          # groupby returns a generator!

In [102]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.944335  0.369585
1    a  two -0.252704 -0.031236
4    a  one -0.841211 -1.723035
b
  key1 key2     data1     data2
2    b  one -1.170507  0.342664
3    b  two  1.154536 -0.511929

In [103]:
for (name1, name2), group in df.groupby(['key1', 'key2']):     # must use a tuple in a tuple
    print((name1, name2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.944335  0.369585
4    a  one -0.841211 -1.723035
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.252704 -0.031236
('b', 'one')
  key1 key2     data1     data2
2    b  one -1.170507  0.342664
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.154536 -0.511929

In [104]:
list(df.groupby('key1'))

[('a',
    key1 key2     data1     data2
  0    a  one  0.944335  0.369585
  1    a  two -0.252704 -0.031236
  4    a  one -0.841211 -1.723035),
 ('b',
    key1 key2     data1     data2
  2    b  one -1.170507  0.342664
  3    b  two  1.154536 -0.511929)]

In [105]:
dict(list(df.groupby('key1')))

{'a':   key1 key2     data1     data2
 0    a  one  0.944335  0.369585
 1    a  two -0.252704 -0.031236
 4    a  one -0.841211 -1.723035,
 'b':   key1 key2     data1     data2
 2    b  one -1.170507  0.342664
 3    b  two  1.154536 -0.511929}

In [106]:
dict(list(df.groupby('key1')))['b']

  key1 key2     data1     data2
2    b  one -1.170507  0.342664
3    b  two  1.154536 -0.511929

In [107]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=list('abcde'),
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe    -0.678966  0.642801  0.715986 -1.361268 -0.900187
Steve   0.176810  1.324294  0.180573  1.155850  0.567321
Wes     0.762945       NaN       NaN -0.006511  1.604927
Jim     0.770793 -2.150680 -1.163765  0.845163  0.370258
Travis -0.980560  0.288312  1.377862 -0.363340 -1.636905

In [108]:
map_dict = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

In [109]:
people.groupby(map_dict, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [110]:
map_series = pd.Series(map_dict)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [111]:
grouped

In [114]:
grouped.mean()

         data1     data2
key1
a    -0.049860 -0.461562
b    -0.007986 -0.084632

In [113]:
grouped.agg(np.mean)

         data1     data2
key1
a    -0.049860 -0.461562
b    -0.007986 -0.084632

In [116]:
grouped.agg([np.mean, np.std])

         data1               data2
          mean       std      mean       std
key1
a    -0.049860  0.909892 -0.461562  1.110698
b    -0.007986  1.644054 -0.084632  0.604289

In [117]:
grouped.agg({'data1': np.mean, 'data2': np.std})

         data1     data2
key1
a    -0.049860  1.110698
b    -0.007986  0.604289

In [126]:
grouped.agg({'data1': np.mean, 'data2': [np.std, np.mean, np.max]})

         data1     data2
          mean       std      mean      amax
key1
a    -0.049860  1.110698 -0.461562  0.369585
b    -0.007986  0.604289 -0.084632  0.342664

In [127]:
grouped.agg({'data1': 'mean', 'data2': ['std', 'mean', 'max']})

         data1     data2
          mean       std      mean       max
key1
a    -0.049860  1.110698 -0.461562  0.369585
b    -0.007986  0.604289 -0.084632  0.342664

In [128]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
quartiles = pd.cut(frame['data1'], 4)

In [129]:
quartiles[:10]

0     (-0.0897, 1.359]
1     (-0.0897, 1.359]
2       (1.359, 2.808]
3     (-2.994, -1.539]
4    (-1.539, -0.0897]
5     (-0.0897, 1.359]
6     (-0.0897, 1.359]
7     (-0.0897, 1.359]
8     (-0.0897, 1.359]
9     (-0.0897, 1.359]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.994, -1.539] < (-1.539, -0.0897] < (-0.0897, 1.359] < (1.359, 2.808]]

In [133]:
quartiles.dtype

CategoricalDtype(categories=[(-2.994, -1.539], (-1.539, -0.0897], (-0.0897, 1.359], (1.359, 2.808]],
              ordered=True)

In [136]:
grouped = frame.groupby(quartiles)['data2']     # is a generator waiting to be called

In [139]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(), 'count': group.count()}
grouped.apply(get_stats).unstack()     # get stats for 'data2' for each quartile group of 'data1'

                        min       max  count
data1
(-2.994, -1.539]  -2.835006  1.772209   67.0
(-1.539, -0.0897] -3.281477  3.172107  370.0
(-0.0897, 1.359]  -2.342476  3.280929  479.0
(1.359, 2.808]    -2.760134  1.835603   84.0